import './App.css';
import Todos from './Components/Todos';

// JUST PRACTICE
// Тапшырма боюнча сиздер Login Жана sign up форма жасайсыздар 
// 		Канча компонента болот ? Кандай методдорду    колдонобуз ? озунуздор чечиниздер)
// Эн маанилуусу сиздер sign up компоненти тузгондо анын ичинде уч input болот:
// input username
// input gmail
// input password
// 	ушул уч инпутка user маанилерин берип жатканда 
// 	томондогу нерселер болуш керек 
// username’де обязательно сан болуш керек сан болбосо кнопка иштебейтурган кылыш керек жанан user’е айтыш керек(username must have digits)
// gmail томонодогуну шаблон менен текшерилиш керек андан кийин шаблон аркылуу тестен отпосо анда user’е айтыш керек (gmail is not valid):
// const validEmailRegex = RegExp(
// /^(([^<>()\[\]\.,;:\s@\"]+(\.[^<>()\[\]\.,;:\s@\"]+)*)|(\".+\"))@(([^<>()[\]\.,;:\s@\"]+\.)+[^<>()[\]\.,;:\s@\"]{2,})$/i
// );
// password проверкасы жон гана 5 любой символ        болуш керек жанан символ сакталып жатканда томондогудой иштеш керек: 
// МИСАЛЫ: мен 12345 деп жазган болсом 
// жазылган 12345 тескерисинен болуп 
// 54321 жана жогорудагы жазылган маанидеги биринчи экинчи турган сандар кошулуп калыш керек: башкача айтканда:
// 12345 деп жазсам ал биринчи 54321 болот жанан биринчи жазылган маанидеги эки сан кошулат: 5432112 
// эгерде баары тура болсо анда сиз ал колдонуучуну жон гана login деген страницага которуп коюшунуз керек(эту тему мы не проходили но кто сделает отдельно похвалю)




function App() {
  return (
    <div className="App">
      <Todos/>
    </div>
  );
}

export default App;
